<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <title>Viewer f&uuml;r virtuelles Training &ndash; Hilfe</title>
    <style type="text/css">
        body {
            font-family: verdana;
            font-size: 80%;
            background-color: white;
            color: black;
            margin-top: 12pt;
            margin-bottom: 10pt;
            margin-left: 10pt;
            margin-right: 10pt;
        }

        p {
            font-family: verdana;
            font-size: 100%;
            color: black;
            margin-top: 6pt;
            margin-bottom: 6pt;
            margin-left: 0pt;
        }

        li {
            font-family: verdana;
            font-size: 100%;
            margin-left: 0pt;
        }

        td {
            font-family: verdana;
            font-size: 70%;
            color: black;

            background-color: whitesmoke;
            margin: 4px;
            padding-left: 4px;
            padding-right: 4px;
            padding-top: 2px;
            padding-bottom: 2px;
            border: solid 1px white;
            vertical-align: top;
        }

        th {
            font-family: verdana;
            font-size: 70%;
            color: black;
            text-align: left;

            background-color: gainsboro;
            padding: 4px;
            border: solid 1px white;
        }

        h1,
        h2,
        h3,
        h4,
        h5 {
            text-align: left;
            color: darkslategray;
        }

        h1 {
            font-size: 150%;
            margin-top: 20pt;
            margin-bottom: 0pt;

        }

        h2 {
            font-size: 120%;
            margin-left: 9pt;
            margin-bottom: 0pt;
            margin-top: 0pt;
        }

        h3 {
            font-size: 110%;
            margin-bottom: 6pt;
            color: black;
        }

        ul {
            margin-top: 0pt;
            margin-bottom: 6pt;
            color: black;
            list-style-type: disc;
        }

        ol {
            margin-left: 0px;
            margin-top: 0pt;
            margin-bottom: 6pt;
        }
		
        li {
            font-family: verdana;
            font-size: 100%;
            margin-left: 0pt;
        }		

       
        table {
            font-size: medium;
        }
		
        div.note {
            background-image: url(images/note1.png);
            background-repeat: no-repeat;
            background-color: white;
            margin-top: 12pt;
            margin-bottom: 0pt;
            margin-left: 0pt;
		}

        img.btn {
            margin: 2px 4px;
            width: 16px;
            height: 16px;
        }

        img.btn.inline {
            margin: 0 2px 0 4px;
        }
    </style>
</head>


<body>
    <div id="main">
        <h1>3D-Trainingsanwendung &ndash; Benutzeroberfl&auml;che</h1>
        <p>
            Mit dieser 3D-Trainingsanwendung k&ouml;nnen Sie den Trainingsvorgang lernen. Die Trainingsanwendung besitzt drei verschiedene Modi:
            <ul>
                <li>
                    <b>Demo-Modus</b> &ndash; Automatisches Abspielen des Vorgangs. Sie k&ouml;nnen die gew&uuml;nschten Schritte mehrmals in unterschiedlichen Geschwindigkeiten abspielen und den Vorgang aus verschiedenen Blickwinkeln untersuchen.</li>
                <li>
                    <b>Lernmodus</b> &ndash; Eine interaktive Wiedergabe des Vorgangs. Sie k&ouml;nnen den Vorgang mithilfe verschiedener Hinweise ausf&uuml;hren.</li>
                <li>
                    <b>Pr&uuml;fmodus</b> &ndash; Pr&uuml;fen Sie Ihr Wissen. Der Vorgang muss ohne Hinweise ausgef&uuml;hrt werden.
                </li>
            </ul>
        </p>

        <h1>Schulungsumgebung</h1>
        <p>
            Im unteren Fenster k&ouml;nnen Sie den gew&uuml;nschten Trainingsmodus ausw&auml;hlen und aktivieren:
		</p>			
		<p>
            <img src="images/operation_pane.png" width="412" height="58" />
        </p>
        <p>
            Im Demo- und im Pr&uuml;fmodus k&ouml;nnen Sie die Wiedergabe des Vorgangs &uuml;ber eine Steuertafel steuern:
		</p>			
		<p>			
            <img src="images/operation_pane_mode_selected.png" width="412" height="66" />
        </p>

        <ul>
            <li>
                <b>Schritt abspielen</b> startet (bzw. beendet) die Wiedergabe des Vorgangs. </li>
            <li>
                <b>Schritt zur&uuml;cksetzen</b> beendet den aktuellen Schritt und springt wieder zum Anfang. </li>
            <li>
                <b>Vorheriger Schritt</b> bewegt die Wiedergabe zum vorherigen Schritt zur&uuml;ck.</li>
            <li>
                <b>N&auml;chster Schritt</b> bewegt die Wiedergabe zum n&auml;chsten Schritt. </li>
            <li>
                <b>Modus deaktivieren</b> deaktiviert den aktuellen Modus.</li>
        </ul>

        <p>
            <img src="images/playing_options1.png" width="412" height="64" />
		</p>			
		
            <ul>
                <li>
                    <b>Position</b> erm&ouml;glicht das Bewegen der Kamera an den gew&uuml;nschten Bereich des 3D-Modells.</li>
            </ul>
        
        <p>
            Das <b>Vorgangsfenster</b> stellt den erwarteten Vorgang oder eine Gruppe aus Vorg&auml;ngen dar. Lesen Sie die Anweisungen und f&uuml;hren Sie die Aktionen durch, z.&nbsp;B. das Eingeben des erforderlichen Parameters, oder w&auml;hlen Sie das Objekt aus, das zu einem Vorgang geh&ouml;rt:
		</p>			
		<p>			
            <img src="images/operation_panel1.png" width="412" height="142" />
        </p>

        <p>
            Das obere Fenster hilft Ihnen dabei, den Vorgang abzuschlie&szlig;en:
		</p>			
		<p>			
            <img src="images/upper_pane1.png" width="412" height="124" />
		</p>			
            <ul>
                <li>
                    <b>Dokument</b>. Zeigt den Teil des Dokuments an, der zum aktuell aktiven Vorgangsschritt geh&ouml;rt. </li>
                <li>
                    <b>Anweisungen</b>. Zeigt Kommentare an, die mit dem aktuellen Trainingsschritt verkn&uuml;pft sind. </li>
                <li>
                    <b>Teile</b>. Zeigt die Liste der inaktiven Objekte im aktuellen Training an. Erm&ouml;glicht es Ihnen, Positionen von Objekten zu finden und zus&auml;tzliche Meta-Informationen anzuzeigen.</li>
                <li>
                    <b>Parameter</b>. Zeigt eine Liste der Parameter an, die im aktuellen Training verwendet werden. Diese Parameter werden als bedingte Spr&uuml;nge im Trainingsszenario verwendet. Sie k&ouml;nnen aufgefordert werden, einen solchen Parameter einzugeben.
                </li>
            </ul>
        

        <h1>Trainingsmodi</h1>

        <p>
            <h2>Demo-Modus</h2>
            <ul>
                <li>Um in diesen Modus zu wechseln, w&auml;hlen Sie den Demo-Modus aus und klicken Sie anschlie&szlig;end auf <b>Modus aktivieren</b>.</li>
                <li>Um die Wiedergabe zu starten, klicken Sie auf <b>Schritt abspielen</b>. Die Beschreibung des derzeit aktiven Schritts wird auf der Registerkarte &quot;Dokument&quot; angezeigt. </li>
                <li>Der Vorgang wird kontinuierlich angezeigt.</li>
                <li>Um die Wiedergabe zu unterbrechen, klicken Sie auf <b>Pausieren</b>. Klicken Sie auf <b>Abspielen</b>, um die Wiedergabe fortzusetzen. </li>
                <li>Um die Beschreibung des gesamten Vorgangs anzuzeigen, klicken Sie auf <b>Dokument</b>. </li>
                <li>Sie k&ouml;nnen im 3D-Fenster navigieren (siehe den Abschnitt &quot;Navigation im 3D-Fenster&quot; in diesem Dokument).
                </li>
                <li> Die Registerkarte &quot;Teile&quot; erm&ouml;glicht es Ihnen, das gew&uuml;nschte Teil im 3D-Fenster hervorzuheben (klicken Sie auf &quot;Suchen&quot;) und zus&auml;tzliche Informationen anzuzeigen (klicken Sie auf &quot;Meta&quot;). </li>
                <li>Um zum n&auml;chsten oder vorherigen Schritt des Vorgangs zu wechseln, klicken Sie auf <b>N&auml;chster Schritt</b> oder <b>Vorheriger Schritt</b>. </li>
                <li>Um den Demo-Modus zu beenden, klicken Sie auf <b>Modus deaktivieren</b>. </li>
            </ul>
        </p>



        <p>
            <h2>Lernmodus</h2>
            <ul>
                <li>Um in diesen Modus zu wechseln, w&auml;hlen Sie den <b>Lernmodus</b> aus und klicken Sie anschlie&szlig;end auf <b>Modus aktivieren</b>.</li>
                <li>Klicken Sie auf <b>Schritt abspielen</b>, um mit dem Lernen des Vorgangs zu beginnen. Befolgen Sie die Anweisungen im Fenster &quot;Operation&quot;. Es gibt drei Gruppen von Anweisungen: </li>
                <ol>
                    <li>Finden Sie die Teile, die im aktuellen Vorgangsschritt involviert sind, und klicken Sie dann im 3D-Fenster oder auf der Registerkarte &quot;Teile&quot; darauf.</li>
                    <li>W&auml;hlen Sie die richtige Antwort aus der Liste &quot;Optionen&quot; aus. </li>
                    <li>Geben Sie einen Wert f&uuml;r einen Parameter ein. </li>
                </ol>
                <li>Mit der Schaltfl&auml;che <b>&Uuml;berspringen</b> k&ouml;nnen Sie zum n&auml;chsten Vorgang im Trainingsszenario springen. </li>
                <li>Das <b>Testergebnis</b> stellt die gemachten Fehler visuell dar (gr&uuml;n = richtig, rot = falsch). Die Fehlerstufe wird in der 3D-Simulation festgelegt und erh&ouml;ht sich schrittweise f&uuml;r den aktuellen Schritt. Jeder neue Schritt beginnt mit 0 Fehlern. </li>
                <li>Schlie&szlig;en Sie alle Schritte ab und klicken Sie auf <b>Modus deaktivieren</b>, wenn Sie den Lernmodus beenden m&ouml;chten. </li>
            </ul>
        </p>

        <p>
            <h2>Pr&uuml;fmodus</h2>
            <ul>
                <li>Um in diesen Modus zu wechseln, w&auml;hlen Sie den <b>Pr&uuml;fmodus</b> aus und klicken Sie anschlie&szlig;end auf <b>Modus aktivieren</b>. </li>
                <li>Klicken Sie auf <b>Start</b>, um mit dem Test zu beginnen. Hier sollten Sie die Aktionen genauso ausf&uuml;hren wie im Lernmodus, es stehen jedoch keine Hinweise mehr zur Verf&uuml;gung. </li>
                <li>Um den Pr&uuml;fmodus zu beenden, klicken Sie auf <b>Modus deaktivieren</b>.</li>
            </ul>
        </p>

        <h1>Navigation im 3D-Fenster</h1>
        <p>
            Sie k&ouml;nnen im 3D-Fenster mithilfe der Maus oder der Navigationsleiste navigieren:
		</p>			
		<p>			
            <img src="images/navigation_bar.png" width="412" height="30" />
        </p>
        <p>
            <b>Zum Vergr&ouml;&szlig;ern/Verkleinern des 3D-Modells:</b>
            <ul>
                <li>Verwenden Sie das Mausrad. </li>
                <li>Klicken Sie alternativ auf &quot;Zoomen&quot; <img class="btn inline" src="../../../../components/rococo/img/sbtn_zoom.png"> auf der Navigationsleiste, positionieren Sie den Mauszeiger an einer beliebigen Stelle im 3D-Fenster, halten Sie die linke Maustaste gedr&uuml;ckt und bewegen Sie die Maus. </li>
            </ul>
        </p>
        <p>
            <b>Zum Bewegen der Kamera nach unten/oben oder links/rechts:</b>
            <ul>
                <li>Positionieren Sie den Mauszeiger an einer beliebigen Stelle im 3D-Fenster, dann bewegen Sie die Maus und halten Sie dabei die mittlere Taste (bzw. das Mausrad) gedr&uuml;ckt. </li>
                <li>Klicken Sie alternativ auf &quot;Verschieben&quot; <img class="btn inline" src="../../../../components/rococo/img/sbtn_pan.png"> auf der Navigationsleiste, positionieren Sie den Zeiger im 3D-Fenster, halten Sie die linke Maustaste gedr&uuml;ckt und bewegen Sie die Maus.</li>
            </ul>
        </p>
        <p>
            <b>Um das gesamte 3D-Modell im 3D-Fenster komplett sichtbar zu machen</b>
            <ul>
                <li>Klicken Sie in der Navigationsleiste auf &quot;Einpassen&quot; <img class="btn inline" src="../../../../components/rococo/img/btn_fit.png">. </li>
            </ul>
        </p>
        <p>
            <b>Um das 3D-Modell zu drehen:</b>
            <ul>
                <li>Klicken Sie auf &quot;Drehen&quot; <img class="btn inline" src="../../../../components/rococo/img/sbtn_spin.png"> auf der Navigationsleiste, positionieren Sie den Mauszeiger &uuml;ber dem 3D-Modell, halten Sie die linke Maustaste gedr&uuml;ckt und bewegen Sie die Maus. </li>
            </ul>
        </p>
        <p>
            <b>Um das Rotationszentrum des 3D-Modells festzulegen:</b>
            <ul>
                <li>Halten Sie die ALT-Taste gedr&uuml;ckt und klicken Sie auf eine Geometrie im 3D-Fenster.</li>
                <li>Positionieren Sie alternativ den Mauszeiger &uuml;ber einer beliebigen Geometrie im 3D-Fenster und dr&uuml;cken Sie die mittlere Maustaste (oder das Mausrad). </li>
            </ul>
        </p>

        <p>
            <b>Um zum n&auml;chsten Vorgangsschritt (Animation) zu wechseln:</b>
            <ul>
                <li>Klicken Sie auf &quot;Aktuelle Animation &uuml;berspringen&quot; <img class="btn inline" src="../../../../components/rococo/img/btn_skip_anim.png">.
                </li>

            </ul>
        </p>

        <h1>Einstellungen</h1>
        <p>
            <ul>
                <li>
                    <b>Geschwindigkeit</b>. Legt die Wiedergabegeschwindigkeit f&uuml;r den 3D-Vorgang fest.
                </li>
                <li>
                    <b>Ansichtspunkt einfrieren</b>. Wenn diese Option ausgew&auml;hlt ist, wird die aktuelle Position des Viewers f&uuml;r die Wiedergabe verwendet.
                </li>
                <li>
                    <b>Warnmeldungen deaktivieren</b>. Wenn diese Option ausgew&auml;hlt ist, wird die Ausgabe von Warnmeldungen blockiert. </li>
                <li>
                    <b>Besondere Hervorhebung von Teilen in DEMO- und LERNMODUS aktivieren</b>. Wenn diese Option ausgew&auml;hlt ist (Standardwert), wird eine halb durchsichtige blinkende Kugel oberhalb des ausgew&auml;hlten 3D-Objekts angezeigt, um die Aufmerksamkeit des Lernenden zu wecken.
                </li>

                <li>
                    <b>Fortlaufende Wiedergabe im Demomodus</b>. Wenn diese Option ausgew&auml;hlt ist (Standardwert), ist die unterbrechungsfreie Wiedergabe des Trainingsvorgangs m&ouml;glich. Wenn deaktiviert, wird die Wiedergabe nach jedem Schritt gestoppt.</li>

                <li>
                    <b>Direkte Hinweise im Lernmodus aktivieren</b>. Zeigt im Vorgangsbereich die Informationen &uuml;ber die Aktionen des Schulungsteilnehmers an, die durchgef&uuml;hrt werden sollten, oder blendet sie aus. Wenn Sie direkte Hinweise erm&ouml;glichen, k&ouml;nnen Sie das Teil mithilfe der Schaltfl&auml;che zum Suchen des Teils (sie tr&auml;gt den Namen des erforderlichen Teils) finden. Dar&uuml;ber hinaus werden bei Aktivierung direkter Hinweise die richtigen Antworten in der Auswahlliste angezeigt.</li>
				<li>
                    <b>Navigationsw&uuml;rfel anzeigen</b>. Blendet den Navigationsw&uuml;rfel im 3D-Fenster ein oder aus. Der Navigations-W&uuml;rfel verf&uuml;gt &uuml;ber drei verschiedene Typen von Hotspot-Bereichen: Kante, Ecke und Fl&auml;che. Wenn Sie den Mauszeiger auf die Kante, Ecke oder Fl&auml;che des Navigations-W&uuml;rfels positionieren, wird der entsprechende Bereich hervorgehoben. Mit diesen Bereichen k&ouml;nnen Sie zwischen Standardansichten umschalten und Drehungen vornehmen.
					</li>
                <li>    
                    <b>Oberfl&auml;chenkanten anzeigen</b>. Wenn diese Option ausgew&auml;hlt ist, wird die Anzeige von Oberfl&auml;chengrenzen im 3D-Fenster aktiviert.
                    </li>					
                <li>
                    <b>Anti-Aliasing</b>. Aktiviert eine Technik zur Minimierung der Verwindungsartefakte im 3D-Fenster.</li>					
                <li>
                    <b>Umgebungsverdeckung</b>. Aktiviert die Schattierungs- und Darstellungsmethode f&uuml;r die Umgebungsverdeckung im 3D-Fenster.</li> 					
                <li>
                    <b>Umriss f&uuml;r schwebende Objekte</b>. Die Auswahl wird umrissen.
				</li>					
            </ul>
        </p>
    </div>
</body>

</html>
